{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"cad60876-b764-59d9-b625-086dab4f0c23","frontmatter":{"demo":"//arxiv.org/abs/2003.03613","excerpt":"In this paper, we propose an end to end solution for image matting i.e high-precision extraction of foreground objects from natural images. Image matting and background detection can be achieved easily through chroma keying in a studio setting when the background is either pure green or blue. Nonetheless, image matting in natural scenes with complex and uneven depth backgrounds remains a tedious task that requires human intervention. To achieve complete automatic foreground extraction in natural scenes, we propose a method that assimilates semantic segmentation and deep image matting processes into a single network to generate detailed semantic mattes for image composition task. The contribution of our proposed method is two-fold, firstly it can be interpreted as a fully automated semantic image matting method and secondly as a refinement of existing semantic segmentation models. We propose a novel model architecture as a combination of segmentation and matting that unifies the function of upsampling and downsampling operators with the notion of attention.","iframe":"//arxiv.org/pdf/2003.03613.pdf","src":"//arxiv.org/abs/2003.03613","title":"AlphaNet- An Attention Guided Deep Network for Automatic Image Matting"},"fields":{"slug":"/case-studies/alpha-net-an-attention-guided-deep-network-for-automatic-image-matting"}}},{"node":{"id":"8e9f83a8-543d-5fe8-ab4a-a00d471e8839","frontmatter":{"demo":"//sciencedirect.com/science/article/pii/S1877050920315325","excerpt":"In the history of artificial neural networks, LSTMs have proved to be a high-performance architecture at sequential data learning. Although LSTMs are remarkable in learning sequential data but are limited in their ability to learn long-term dependencies and representation of certain data structures because of the lack of external memory. In this paper, we tackled two main tasks, one is language translation and other is image captioning. We approached the problem of language translation by leveraging the capabilities of the recently developed DNC architectures. Here we modified the DNC architecture by including dual neural controllers instead of one and an external memory module. Inside our controller, we employed a neural network with memory-augmentation which differs from the original differentiable neural computer, we implemented a dual controller’s system in which one controller is for encoding the query sequence whereas another controller is for decoding the translated sequences.","iframe":"//sciencedirect.com/science/article/pii/S1877050920315325","src":"//sciencedirect.com/science/article/pii/S1877050920315325","title":"Employing Differentiable Neural Computers for Image Captioning and Neural Machine Translation"},"fields":{"slug":"/case-studies/employing-differentiable-neural-computers-for-image-captioning-and-neural-machine-translation"}}},{"node":{"id":"dec8a4e1-f01c-5856-8e1d-ffe21ce8d905","frontmatter":{"demo":"//anuraghazra.github.io/VerlyRangeSlider","excerpt":"Verly Range Slider is one of my fun projects which uses my Verly.js physics engine, and it also got mentioned in CodepenSpark. verly range slider got viral on the net and got over 15K views on codepen.io. It uses Verlet physics to simulate those delightful dangly sliders.","iframe":"//codepen.io/anuraghazra/embed/agKJEd/?default-tab=result&theme-id=light","src":"//github.com/anuraghazra/VerlyRangeSlider","title":"Verly Range Slider"},"fields":{"slug":"/case-studies/verly-range-slider"}}},{"node":{"id":"a235c13f-e69d-50bb-9b65-e0af76bf6254","frontmatter":{"demo":"//anuraghazra.github.io/EvolutionAquerium","excerpt":"Evolution Aquarium is based on Craig Reynold's Steering Behaviors and Flocking System, and It implements a Genetic Algorithm and mutations. Daniel Shiffman showcased this on his Youtube Channel at TheCodingTrain. And I was pleased about the humble feedback; sir Daniel Shiffman gave to me. It just boosted my confidence more and more, and motivated me to make this project better.","iframe":"//www.youtube.com/embed/GKIhVrOsQCI/?modestbranding=1&showinfo=0&autohide=1&rel=0","src":"//github.com/anuraghazra/EvolutionAquerium","title":"Evolution Aquerium"},"fields":{"slug":"/case-studies/evolution-aquerium"}}}]}}}